{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "bn2a_branch1/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/beta", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "bn2a_branch2a/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "bn2a_branch2b/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "bn2a_branch2c/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/beta", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "bn2b_branch2a/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "bn2b_branch2b/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "bn2b_branch2c/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/beta", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "bn2c_branch2a/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "bn2c_branch2b/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "bn2c_branch2c/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/beta", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "bn3a_branch1/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "bn3a_branch2a/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "bn3a_branch2b/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "bn3a_branch2c/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "bn3b_branch2a/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "bn3b_branch2b/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "bn3b_branch2c/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "bn3c_branch2a/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "bn3c_branch2b/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "bn3c_branch2c/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "bn3d_branch2a/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "bn3d_branch2b/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "bn3d_branch2c/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/beta", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "bn4a_branch1/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "bn4a_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "bn4a_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group27-shard1of1"], "weights": [{"name": "bn4a_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"name": "bn4b_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"name": "bn4b_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group30-shard1of1"], "weights": [{"name": "bn4b_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group31-shard1of1"], "weights": [{"name": "bn4c_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group32-shard1of1"], "weights": [{"name": "bn4c_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group33-shard1of1"], "weights": [{"name": "bn4c_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group34-shard1of1"], "weights": [{"name": "bn4d_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group35-shard1of1"], "weights": [{"name": "bn4d_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group36-shard1of1"], "weights": [{"name": "bn4d_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group37-shard1of1"], "weights": [{"name": "bn4e_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group38-shard1of1"], "weights": [{"name": "bn4e_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group39-shard1of1"], "weights": [{"name": "bn4e_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group40-shard1of1"], "weights": [{"name": "bn4f_branch2a/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group41-shard1of1"], "weights": [{"name": "bn4f_branch2b/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/beta", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group42-shard1of1"], "weights": [{"name": "bn4f_branch2c/gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group43-shard1of1"], "weights": [{"name": "bn5a_branch1/gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/moving_variance", "shape": [2048], "dtype": "float32"}]}, {"paths": ["group44-shard1of1"], "weights": [{"name": "bn5a_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group45-shard1of1"], "weights": [{"name": "bn5a_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group46-shard1of1"], "weights": [{"name": "bn5a_branch2c/gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/moving_variance", "shape": [2048], "dtype": "float32"}]}, {"paths": ["group47-shard1of1"], "weights": [{"name": "bn5b_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group48-shard1of1"], "weights": [{"name": "bn5b_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group49-shard1of1"], "weights": [{"name": "bn5b_branch2c/gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/moving_variance", "shape": [2048], "dtype": "float32"}]}, {"paths": ["group50-shard1of1"], "weights": [{"name": "bn5c_branch2a/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group51-shard1of1"], "weights": [{"name": "bn5c_branch2b/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/beta", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group52-shard1of1"], "weights": [{"name": "bn5c_branch2c/gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/moving_variance", "shape": [2048], "dtype": "float32"}]}, {"paths": ["group53-shard1of1"], "weights": [{"name": "bn_conv1/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/beta", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group54-shard1of1"], "weights": [{"name": "conv1/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "conv1/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group55-shard1of1"], "weights": [{"name": "res2a_branch1/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2a_branch1/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group56-shard1of1"], "weights": [{"name": "res2a_branch2a/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "res2a_branch2a/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group57-shard1of1"], "weights": [{"name": "res2a_branch2b/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res2a_branch2b/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group58-shard1of1"], "weights": [{"name": "res2a_branch2c/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2a_branch2c/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group59-shard1of1"], "weights": [{"name": "res2b_branch2a/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "res2b_branch2a/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group60-shard1of1"], "weights": [{"name": "res2b_branch2b/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res2b_branch2b/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group61-shard1of1"], "weights": [{"name": "res2b_branch2c/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2b_branch2c/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group62-shard1of1"], "weights": [{"name": "res2c_branch2a/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "res2c_branch2a/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group63-shard1of1"], "weights": [{"name": "res2c_branch2b/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res2c_branch2b/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group64-shard1of1"], "weights": [{"name": "res2c_branch2c/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2c_branch2c/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group65-shard1of1"], "weights": [{"name": "res3a_branch1/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "res3a_branch1/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group66-shard1of1"], "weights": [{"name": "res3a_branch2a/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "res3a_branch2a/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group67-shard1of1"], "weights": [{"name": "res3a_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3a_branch2b/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group68-shard1of1"], "weights": [{"name": "res3a_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3a_branch2c/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group69-shard1of1"], "weights": [{"name": "res3b_branch2a/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "res3b_branch2a/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group70-shard1of1"], "weights": [{"name": "res3b_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3b_branch2b/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group71-shard1of1"], "weights": [{"name": "res3b_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3b_branch2c/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group72-shard1of1"], "weights": [{"name": "res3c_branch2a/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "res3c_branch2a/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group73-shard1of1"], "weights": [{"name": "res3c_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3c_branch2b/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group74-shard1of1"], "weights": [{"name": "res3c_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3c_branch2c/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group75-shard1of1"], "weights": [{"name": "res3d_branch2a/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "res3d_branch2a/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group76-shard1of1"], "weights": [{"name": "res3d_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3d_branch2b/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group77-shard1of1"], "weights": [{"name": "res3d_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3d_branch2c/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group78-shard1of1"], "weights": [{"name": "res4a_branch1/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "res4a_branch1/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group79-shard1of1"], "weights": [{"name": "res4a_branch2a/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "res4a_branch2a/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group80-shard1of1"], "weights": [{"name": "res4a_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4a_branch2b/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group81-shard1of1"], "weights": [{"name": "res4a_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4a_branch2c/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group82-shard1of1"], "weights": [{"name": "res4b_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4b_branch2a/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group83-shard1of1"], "weights": [{"name": "res4b_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4b_branch2b/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group84-shard1of1"], "weights": [{"name": "res4b_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4b_branch2c/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group85-shard1of1"], "weights": [{"name": "res4c_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4c_branch2a/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group86-shard1of1"], "weights": [{"name": "res4c_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4c_branch2b/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group87-shard1of1"], "weights": [{"name": "res4c_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4c_branch2c/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group88-shard1of1"], "weights": [{"name": "res4d_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4d_branch2a/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group89-shard1of1"], "weights": [{"name": "res4d_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4d_branch2b/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group90-shard1of1"], "weights": [{"name": "res4d_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4d_branch2c/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group91-shard1of1"], "weights": [{"name": "res4e_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4e_branch2a/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group92-shard1of1"], "weights": [{"name": "res4e_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4e_branch2b/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group93-shard1of1"], "weights": [{"name": "res4e_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4e_branch2c/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group94-shard1of1"], "weights": [{"name": "res4f_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4f_branch2a/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group95-shard1of1"], "weights": [{"name": "res4f_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4f_branch2b/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group96-shard1of1"], "weights": [{"name": "res4f_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4f_branch2c/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group97-shard1of3", "group97-shard2of3", "group97-shard3of3"], "weights": [{"name": "res5a_branch1/kernel", "shape": [1, 1, 1024, 2048], "dtype": "float32"}, {"name": "res5a_branch1/bias", "shape": [2048], "dtype": "float32"}]}, {"paths": ["group98-shard1of1"], "weights": [{"name": "res5a_branch2a/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "res5a_branch2a/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group99-shard1of3", "group99-shard2of3", "group99-shard3of3"], "weights": [{"name": "res5a_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5a_branch2b/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group100-shard1of2", "group100-shard2of2"], "weights": [{"name": "res5a_branch2c/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "res5a_branch2c/bias", "shape": [2048], "dtype": "float32"}]}, {"paths": ["group101-shard1of2", "group101-shard2of2"], "weights": [{"name": "res5b_branch2a/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "res5b_branch2a/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group102-shard1of3", "group102-shard2of3", "group102-shard3of3"], "weights": [{"name": "res5b_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5b_branch2b/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group103-shard1of2", "group103-shard2of2"], "weights": [{"name": "res5b_branch2c/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "res5b_branch2c/bias", "shape": [2048], "dtype": "float32"}]}, {"paths": ["group104-shard1of2", "group104-shard2of2"], "weights": [{"name": "res5c_branch2a/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "res5c_branch2a/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group105-shard1of3", "group105-shard2of3", "group105-shard3of3"], "weights": [{"name": "res5c_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5c_branch2b/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group106-shard1of2", "group106-shard2of2"], "weights": [{"name": "res5c_branch2c/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "res5c_branch2c/bias", "shape": [2048], "dtype": "float32"}]}], "modelTopology": {"model_config": {"class_name": "Model", "config": {"name": "resnet50", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 256, 256, 3], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv1_pad", "padding": [[3, 3], [3, 3]], "trainable": true, "data_format": "channels_last"}}, {"name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [2, 2], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv1", "trainable": true, "kernel_size": [7, 7], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn_conv1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn_conv1", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "pool_size": [3, 3], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"name": "res2a_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2a_branch2a", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2a_branch2a", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "res2a_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2a_branch2b", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn2a_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2a_branch2b", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "res2a_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2a_branch2c", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "res2a_branch1", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2a_branch1", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2a_branch2c", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2a_branch1", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "res2b_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2b_branch2a", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn2b_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2b_branch2a", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"name": "res2b_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2b_branch2b", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn2b_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2b_branch2b", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"name": "res2b_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2b_branch2c", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn2b_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2b_branch2c", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"name": "res2c_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2c_branch2a", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn2c_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2c_branch2a", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"name": "res2c_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2c_branch2b", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn2c_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2c_branch2b", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"name": "res2c_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res2c_branch2c", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn2c_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn2c_branch2c", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"name": "res3a_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [2, 2], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res3a_branch2a", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn3a_branch2a", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"name": "res3a_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res3a_branch2b", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "bn3a_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "config": {"scale": true, "beta_constraint": null, "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "name": "bn3a_branch2b", "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"name": "res3a_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [1, 1], "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res3a_branch2c", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": "res3a_branch1", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"bias_constraint": null, "strides": [2, 2], "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "res3a_branch1", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear"}}, {"name": 