{"modelTopology": {"model_config": {"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "padding": [[3, 3], [3, 3]], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "conv1", "padding": "valid", "bias_constraint": null, "strides": [2, 2], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [7, 7], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"name": "bn_conv1", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn_conv1", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [3, 3]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "res2a_branch2a", "class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2a_branch2a", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2a_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "res2a_branch2b", "class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2a_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "bn2a_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2a_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"name": "res2a_branch2c", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2a_branch2c", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "res2a_branch1", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2a_branch1", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2a_branch2c", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2a_branch1", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "res2b_branch2a", "class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2b_branch2a", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "bn2b_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2b_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"name": "res2b_branch2b", "class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2b_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "bn2b_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2b_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"name": "res2b_branch2c", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2b_branch2c", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "bn2b_branch2c", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2b_branch2c", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "res2c_branch2a", "class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2c_branch2a", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "bn2c_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2c_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"name": "res2c_branch2b", "class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2c_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "bn2c_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2c_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"name": "res2c_branch2c", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res2c_branch2c", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "bn2c_branch2c", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn2c_branch2c", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "res3a_branch2a", "class_name": "Conv2D", "config": {"filters": 128, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3a_branch2a", "padding": "valid", "bias_constraint": null, "strides": [2, 2], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3a_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "res3a_branch2b", "class_name": "Conv2D", "config": {"filters": 128, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3a_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3a_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"name": "res3a_branch2c", "class_name": "Conv2D", "config": {"filters": 512, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3a_branch2c", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "res3a_branch1", "class_name": "Conv2D", "config": {"filters": 512, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3a_branch1", "padding": "valid", "bias_constraint": null, "strides": [2, 2], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "bn3a_branch2c", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3a_branch2c", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3a_branch1", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": true}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "res3b_branch2a", "class_name": "Conv2D", "config": {"filters": 128, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3b_branch2a", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "bn3b_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3b_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"name": "res3b_branch2b", "class_name": "Conv2D", "config": {"filters": 128, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3b_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "bn3b_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3b_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"name": "res3b_branch2c", "class_name": "Conv2D", "config": {"filters": 512, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3b_branch2c", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "bn3b_branch2c", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3b_branch2c", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "trainable": true}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "res3c_branch2a", "class_name": "Conv2D", "config": {"filters": 128, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3c_branch2a", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "bn3c_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3c_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"name": "res3c_branch2b", "class_name": "Conv2D", "config": {"filters": 128, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3c_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "bn3c_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3c_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"name": "res3c_branch2c", "class_name": "Conv2D", "config": {"filters": 512, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3c_branch2c", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "bn3c_branch2c", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3c_branch2c", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "activation": "relu", "trainable": true}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "res3d_branch2a", "class_name": "Conv2D", "config": {"filters": 128, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3d_branch2a", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "bn3d_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3d_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"name": "res3d_branch2b", "class_name": "Conv2D", "config": {"filters": 128, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3d_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "bn3d_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3d_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"name": "res3d_branch2c", "class_name": "Conv2D", "config": {"filters": 512, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res3d_branch2c", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "bn3d_branch2c", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn3d_branch2c", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "activation": "relu", "trainable": true}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "res4a_branch2a", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res4a_branch2a", "padding": "valid", "bias_constraint": null, "strides": [2, 2], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "bn4a_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn4a_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"name": "res4a_branch2b", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res4a_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "bn4a_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn4a_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"name": "res4a_branch2c", "class_name": "Conv2D", "config": {"filters": 1024, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res4a_branch2c", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "res4a_branch1", "class_name": "Conv2D", "config": {"filters": 1024, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res4a_branch1", "padding": "valid", "bias_constraint": null, "strides": [2, 2], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "bn4a_branch2c", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn4a_branch2c", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"name": "bn4a_branch1", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn4a_branch1", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "activation": "relu", "trainable": true}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "res4b_branch2a", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res4b_branch2a", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"name": "bn4b_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn4b_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"name": "res4b_branch2b", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res4b_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"name": "bn4b_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn4b_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"name": "activation_27", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"name": "res4b_branch2c", "class_name": "Conv2D", "config": {"filters": 1024, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res4b_branch2c", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"name": "bn4b_branch2c", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn4b_branch2c", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]]}, {"name": "activation_28", "class_name": "Activation", "config": {"name": "activation_28", "activation": "relu", "trainable": true}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "res4c_branch2a", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res4c_branch2a", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"name": "bn4c_branch2a", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn4c_branch2a", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"name": "activation_29", "class_name": "Activation", "config": {"name": "activation_29", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"name": "res4c_branch2b", "class_name": "Conv2D", "config": {"filters": 256, "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "name": "res4c_branch2b", "padding": "same", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"name": "bn4c_branch2b", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": 3, "name": "bn4c_branch2b", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "center": true, "beta_regularizer": null}, "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"name": "activation_30", "class_name": "Activation", "config": {"name": "activation_30", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]]}, {"name": "res4c_branch2c", "class_name": "Conv2D", "config": {"filters": 1024, "bias_regularizer": null, "data_format": "channels_last", 